openfoam13/wall/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.841496e-4;

boundaryField
{
    inlet          { type kqRWallFunction; value $internalField; }
    outlet          { type kqRWallFunction; value $internalField; }
    //inlet           { type zeroGradient; }
    //outlet          { type zeroGradient; }
    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    frontAndBack    { type empty; }
}


// ************************************************************************* //
