openfoam13/wall/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    //inlet           { type cyclic; }
    //outlet          { type cyclic; }
    inlet           
    { 
        type fixedFluxPressure;
        value       uniform 0;
    }
    outlet           
    { 
        type fixedFluxPressure;
        value       uniform 0;
    }
    //inlet           { type zeroGradient; }
    //outlet          { type zeroGradient; }
    //inlet
    //{
    //    type            fixedFluxPressure;
    //    value           uniform 0;
    //}
    //outlet
    //{
    //    type            fixedFluxPressure;
    //    value           uniform 0;
    //}
    bottom          { type fixedFluxPressure; value uniform 0; }
    top             { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
